Repository: tiberiu-ionescu/Develop
Catalog: develop/IDEX/SpecialTools.ProductionModeService/Properties/Resources.*.resx
Languages: es

# ACTION_INFO_ACTIVATED
source: Production Mode activation process finished!
es: ¡El proceso de activación del modo de producción finalizó!

# ACTION_INFO_ACTIVATING
source: Activating Production Mode!
es: ¡Activando el modo de producción!

# ACTION_INFO_DEACTIVATED
source: Production Mode deactivation process finished!
es: ¡El proceso de desactivación del modo de producción finalizó!

# ACTION_INFO_DEACTIVATING
source: Deactivating Production Mode!
es: ¡Desactivación del modo de producción!

# ACTION_INFO_ECU_FAIL
source: {0} might not be set correctly. Reason: {1}
es: Es posible que {0} no esté configurado correctamente. Razón: {1}

# ACTION_INFO_ECU_IN_STATE
source: {0} is now in the state {1}
es: {0} ahora está en el estado {1}

# ACTION_INFO_ECU_MODIFICATION_STARTED
source: Production Mode of {0} will be set to {1}...
es: El modo de producción de {0} se establecerá en {1} ...

# ACTION_INFO_READING
source: Reading Production Mode status!
es: ¡Lectura del estado del modo de producción!

# ACTION_INFO_READING_COMPLETE
source: Production Mode status was read
es: Se leyó el estado del modo de producción

# ACTION_INFO_SETTING_FOR_X_ECUS
source: Setting Production Mode for {0} ECUs
es: Configuración del modo de producción para {0} ECU

# ACTION_INFO_WAITING_FOR_MASTER
source: {0} is now configured to wait for the production mode master signal
es: {0} ahora está configurado para esperar la señal maestra del modo de producción

source: Activate
es: Activar

source: Activating
es: Activando

source: Check
es: Cheque

source: Checking
es: Comprobación

source: Could not connect to Gateway
es: No se pudo conectar a Gateway

source: Deactivate
es: Desactivar

source: Deactivating
es: Desactivando

# LOCALIZED_GROUP_NAME
source: Main Group
es: Grupo Principal

# LOCALIZED_TOOL_DESCRIPTION
source: Tool for reading and setting the Production Mode
es: Herramienta para leer y configurar el modo de production

# LOCALIZED_TOOL_NAME
source: Production Mode
es: Modo de production

# NO_PROJECT
source: Project is not set!
es: ¡El proyecto no se ha configurado!

# NO_PROJECT_ERROR_MSG
source: No Project
es: Sin proyecto

# PRODUCTION_MODE_NOT_SUPPORTED
source: No P-Mode ECU available
es: No hay ECU en P-Modo disponible

# RESULTS
source: Result Log
es: Resultados

# RESULT_ACCESS_DENIED
source: Access Denied
es: Acceso denegado

# RESULT_ADAPTATION_MISSING
source: Adaptation Missing
es: Falta adaptación

# RESULT_ADAPTATION_WRITE_FAILED
source: Adaptation write failed
es: Error de escritura de adaptación

# RESULT_ADAPTATION_WRITE_NRC
source: Adaptation Write NRC
es: Adaptación Escribir NRC

# RESULT_CONNECTION_FAILED
source: Connection failed
es: La conexión falló

# RESULT_CUSTOM_HEX_SERVICE_DISPATCH_FAILED
source: Custom HEX Service dispatch failed
es: Error en el envío del servicio HEX personalizado

# RESULT_CUSTOM_HEX_SERVICE_NRC
source: Custom HEX Service NRC
es: Servicio HEX personalizado NRC

# RESULT_DIAGNOSTIC_TASK_CREATION_FAILED
source: Diagnostic task creation failed
es: Error al crear la tarea de diagnóstico

# RESULT_INVALID_PIN
source: Invalid PIN
es: PIN inválido

# RESULT_MEASUREMENT_BLOCK_MISSING
source: Measurement Block Missing
es: Falta bloque de medida

# RESULT_NO_ERROR
source: No Error
es: No hay error

# RESULT_PMODE_MASTER_NOT_SET
source: PMode Master Not Set
es: PMODE Master no configurado

# RESULT_RESTART_FAILED
source: Restart Failed
es: Reinicio fallido

# RESULT_SESSION_CHANGE_FAILED
source: Session change failed
es: Error en el cambio de sesión

# RESULT_STATE_DID_NOT_CHANGE
source: State did not change
es: El estado no cambió

# RESULT_UNKNOWN_ERROR
source: Unknown Error
es: Error desconocido

# STATE_ACTIVE
source: Active
es: Activo

# STATE_INACTIVE
source: Inactive
es: Inactivo

# STATE_UNKNOWN
source: Unknown
es: Desconocido

# STATE_WAITING_FOR_MASTER
source: Waiting for master switch...
es: Esperando el interruptor principal...
